Revit 2027 API
PolymeshTopology.GetPoints Method
 Returns all points of the polymesh.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<XYZ> GetPoints()
Public Function GetPoints As IList(Of XYZ)
public:
IList<XYZ^>^ GetPoints()
member GetPoints : unit -> IList<XYZ>
Return Value
IList<XYZ>
 An array of XYZ coordinates
See Also
Reference
PolymeshTopology Class
Autodesk.Revit.DB Namespace